#### ✅ Terraform Plan
```
data.oci_core_images.arm: Reading...
data.oci_identity_availability_domains.ads: Reading...
data.oci_core_services.all_services: Reading...
data.oci_identity_availability_domains.ads: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-2343171531]
data.oci_core_services.all_services: Read complete after 1s [id=CoreServicesDataSource-0]
data.oci_core_images.arm: Read complete after 1s [id=CoreImagesDataSource-2267162248]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_containerengine_cluster.k8s will be created
  + resource "oci_containerengine_cluster" "k8s" {
      + available_kubernetes_upgrades      = (known after apply)
      + compartment_id                     = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags                       = (known after apply)
      + endpoints                          = (known after apply)
      + freeform_tags                      = (known after apply)
      + id                                 = (known after apply)
      + kms_key_id                         = (known after apply)
      + kubernetes_version                 = "v1.30.1"
      + lifecycle_details                  = (known after apply)
      + metadata                           = (known after apply)
      + name                               = "myproject-cluster"
      + open_id_connect_discovery_endpoint = (known after apply)
      + open_id_connect_discovery_key      = (known after apply)
      + state                              = (known after apply)
      + type                               = "BASIC_CLUSTER"
      + vcn_id                             = (known after apply)

      + cluster_pod_network_options {
          + cni_type = "FLANNEL_OVERLAY"
        }

      + endpoint_config {
          + is_public_ip_enabled = true
          + subnet_id            = (known after apply)
        }

      + image_policy_config (known after apply)

      + options {
          + ip_families           = (known after apply)
          + service_lb_subnet_ids = (known after apply)

          + add_ons {
              + is_kubernetes_dashboard_enabled = false
              + is_tiller_enabled               = false
            }

          + admission_controller_options {
              + is_pod_security_policy_enabled = false
            }

          + kubernetes_network_config (known after apply)

          + open_id_connect_discovery (known after apply)

          + open_id_connect_token_authentication_config (known after apply)

          + persistent_volume_config (known after apply)

          + service_lb_config (known after apply)
        }
    }

  # oci_containerengine_node_pool.arm will be created
  + resource "oci_containerengine_node_pool" "arm" {
      + cluster_id          = (known after apply)
      + compartment_id      = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags        = (known after apply)
      + freeform_tags       = (known after apply)
      + id                  = (known after apply)
      + kubernetes_version  = "v1.30.1"
      + lifecycle_details   = (known after apply)
      + name                = "myproject-arm-pool"
      + node_image_id       = (known after apply)
      + node_image_name     = (known after apply)
      + node_metadata       = (known after apply)
      + node_shape          = "VM.Standard.A1.Flex"
      + node_source         = (known after apply)
      + nodes               = (known after apply)
      + quantity_per_subnet = (known after apply)
      + ssh_public_key      = (known after apply)
      + state               = (known after apply)
      + subnet_ids          = (known after apply)

      + initial_node_labels {
          + key   = "arch"
          + value = "arm64"
        }

      + node_config_details {
          + defined_tags                        = (known after apply)
          + freeform_tags                       = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + kms_key_id                          = (known after apply)
          + nsg_ids                             = (known after apply)
          + size                                = 1

          + node_pool_pod_network_option_details (known after apply)

          + placement_configs {
              + availability_domain     = "ZzfA:AP-CHUNCHEON-1-AD-1"
              + capacity_reservation_id = (known after apply)
              + fault_domains           = (known after apply)
              + subnet_id               = (known after apply)

              + preemptible_node_config (known after apply)
            }
        }

      + node_eviction_node_pool_settings (known after apply)

      + node_pool_cycling_details (known after apply)

      + node_shape_config {
          + memory_in_gbs = 24
          + ocpus         = 4
        }

      + node_source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + image_id                = "ocid1.image.oc1.ap-chuncheon-1.aaaaaaaa4ch5gx26gtuq4acsbxbfgkpfleogcgk6xfmuerpuobkvg5sgatxa"
          + source_type             = "IMAGE"
        }
    }

  # oci_core_internet_gateway.k8s will be created
  + resource "oci_core_internet_gateway" "k8s" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-igw"
      + enabled        = true
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_nat_gateway.k8s will be created
  + resource "oci_core_nat_gateway" "k8s" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-nat"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + nat_ip         = (known after apply)
      + public_ip_id   = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_route_table.private will be created
  + resource "oci_core_route_table" "private" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-private-rt"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "all-yny-services-in-oracle-services-network"
          + destination_type  = "SERVICE_CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # oci_core_route_table.public will be created
  + resource "oci_core_route_table" "public" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-public-rt"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # oci_core_security_list.api_endpoint will be created
  + resource "oci_core_security_list" "api_endpoint" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-api-endpoint-sl"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "10.0.1.0/24"
          + destination_type = (known after apply)
          + protocol         = "1"
          + stateless        = (known after apply)

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "10.0.1.0/24"
          + destination_type = (known after apply)
          + protocol         = "6"
          + stateless        = (known after apply)

          + tcp_options {
              + max = 12250
              + min = 12250
            }
        }
      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "10.0.1.0/24"
          + destination_type = (known after apply)
          + protocol         = "6"
          + stateless        = (known after apply)

          + tcp_options {
              + max = 6443
              + min = 6443
            }
        }
      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "all-yny-services-in-oracle-services-network"
          + destination_type = "SERVICE_CIDR_BLOCK"
          + protocol         = "6"
          + stateless        = (known after apply)

          + tcp_options {
              + max = 443
              + min = 443
            }
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "10.0.1.0/24"
          + source_type = (known after apply)
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 6443
              + min = 6443
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "10.0.1.0/24"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 12250
              + min = 12250
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "10.0.1.0/24"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 6443
              + min = 6443
            }
        }
    }

  # oci_core_security_list.lb will be created
  + resource "oci_core_security_list" "lb" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-lb-sl"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = (known after apply)
          + protocol         = "all"
          + stateless        = (known after apply)
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
    }

  # oci_core_security_list.workers will be created
  + resource "oci_core_security_list" "workers" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-workers-sl"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = (known after apply)
          + protocol         = "all"
          + stateless        = (known after apply)
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = (known after apply)
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "all"
          + source      = "10.0.0.0/16"
          + source_type = (known after apply)
          + stateless   = false
        }
    }

  # oci_core_service_gateway.k8s will be created
  + resource "oci_core_service_gateway" "k8s" {
      + block_traffic  = (known after apply)
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags   = (known after apply)
      + display_name   = "myproject-sg"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + services {
          + service_id   = "ocid1.service.oc1.ap-chuncheon-1.aaaaaaaav26pw33pfolcobpj62iy6pq2xkkzeiizc2m64i2elbdj5mw4dnra"
          + service_name = (known after apply)
        }
    }

  # oci_core_subnet.api_endpoint will be created
  + resource "oci_core_subnet" "api_endpoint" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.0.0/28"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "myproject-api-endpoint-subnet"
      + dns_label                  = "api"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv4cidr_blocks            = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_subnet.lb will be created
  + resource "oci_core_subnet" "lb" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.0.16/28"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "myproject-lb-subnet"
      + dns_label                  = "lb"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv4cidr_blocks            = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_subnet.workers will be created
  + resource "oci_core_subnet" "workers" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "myproject-workers-subnet"
      + dns_label                  = "workers"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv4cidr_blocks            = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = true
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_vcn.k8s will be created
  + resource "oci_core_vcn" "k8s" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaao36qwrgqqcrnek2e5kldwaevdvei7uark7dblua6tipuewgwrqpq"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "myproject-vcn"
      + dns_label                        = "myproject"
      + freeform_tags                    = (known after apply)
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + security_attributes              = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_id         = (known after apply)
  + kubeconfig_command = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Pushed by: @tlarbals824*